{"_id":{"$oid":"6840cde5b1602cc150368065"},"Title":"The Brutalist","Description":"The Brutalist is the story of fictional Hungarian-Jewish holocaust survivor and renowned architect László Tóth's immigration to the United States, and the personal and professional success and strife he finds there.","Director":{"Name":"Brady Corbet","Bio":"Brady Corbet is an American filmmaker and actor. He made his directorial debut with the psychological drama The \"Childhood of a Leader\" (2015). He has since co-written and directed the musical drama \"Vox Lux\" (2018) and the period epic \"The Brutalist\".","BirthYear":"1988"},"Genre":{"Name":"Period Drama","Description":"Films set in a specific historical era, focusing on the social norms, conflicts, and aesthetics of the time."},"Actors":[{"$oid":"684339c287dc272b16890b78"},{"$oid":"684339c287dc272b16890b79"},{"$oid":"684339c287dc272b16890b7a"},{"$oid":"684339c287dc272b16890b7b"},{"$oid":"684339c287dc272b16890b7c"},{"$oid":"684339c287dc272b16890b7d"}],"ReleaseYear":"2024"}
{"_id":{"$oid":"6840d0b287dc272b16890b6a"},"Title":"Flow","Description":"Flow tells the story of a cat, along with a group of other animals, who attempt to survive a mysterious and extreme flood in a seemingly post-apocalyptic world. The movie features no dialogue.","Director":{"Name":"Gints Zilbalodis","Bio":"Gints Zilbalodis is a Latvian filmmaker, animator, and composer. He is best known for his non-dialogue animated adventure films, such as \"Away\"(2019) and \"Flow\"(2024).","BirthYear":"1994"},"Genre":{"Name":"Animation","Description":"Animation is a filmmaking technique in which still images are manipulated in order to create the appearance of moving image."}}
{"_id":{"$oid":"684190dc87dc272b16890b6b"},"Title":"Sing Sing","Description":"Sing Sing portrays the real-life story of John 'Divine G' Whitfield and the Rehabilitation Through the Arts program at the Sing Sing Maximum Security Prison in New York. The film features inmates attempting to stage a play while they grapple with the US Justice System, and their own personal conflicts (both internal and external).","Director":{"Name":"Greg Kwedar","Bio":"Greg Kwedar is an American film director and screenwriter, best known for writing and directing \"Sing Sing\".","BirthYear":null},"Genre":{"Name":"Prison Film","Description":"Prison Films are often dramas set inside prisons/correctional facilities and are primarily concerned with unique aspects of that setting, such a escape attempts, petitioning for freedom, or the unique social aspects of being in prison."},"Actors":[{"$oid":"684339c287dc272b16890b7e"},{"$oid":"684339c287dc272b16890b7f"},{"$oid":"684339c287dc272b16890b80"}],"ReleaseYear":"2024"}
{"_id":{"$oid":"6841914487dc272b16890b6c"},"Title":"Conclave","Description":"Conclave tells the fictional story of a papal conclave following the death of the Pope. The film portrays factionalism within the College of Cardinals as well as intrigue due to this factionalism.","Director":{"Name":"Edward Berger","Bio":"Edward Berger is an award winning German-born director and screenwriter, know for films such as \"All Quiet on the Western Front\" (2022) and \"Conclave\" (2024).","BirthYear":"1970"},"Genre":{"Name":"Politial Thriller","Description":"Political Thrillers use struggle for political power as a means of setting up tension and suspense associated with a typical thriller film. Films of this genre often employ things such as high stakes negotiation, blackmail, or corruption."},"Actors":[{"$oid":"684339c287dc272b16890b81"},{"$oid":"684339c287dc272b16890b82"},{"$oid":"684339c287dc272b16890b83"},{"$oid":"684339c287dc272b16890b84"}],"ReleaseYear":"2024"}
{"_id":{"$oid":"684191a887dc272b16890b6d"},"Title":"Nickel Boys","Description":"Nickel Boys tells the story of Elwood, a high achieving black high school student in the Jim Crow-era South who is sent to Nickel Academy, a reform school, after being falsely implicated in the theft of a car. The film portrays the abuses he and the other black students suffer (contrasted with the white students), and occasionally cuts to an adult Elwood in late 1980's New York City.","Director":{"Name":"RaMell Ross","Bio":"RaMell Ross is an American filmmaker, photographer, academic, and writer.","BirthYear":"1982"},"Genre":{"Name":"Period Drama","Description":"Films set in a specific historical era, focusing on the social norms, conflicts, and aesthetics of the time."},"Actors":[{"$oid":"684339c287dc272b16890b85"},{"$oid":"684339c287dc272b16890b86"},{"$oid":"684339c287dc272b16890b87"},{"$oid":"684339c287dc272b16890b88"},{"$oid":"684339c287dc272b16890b89"},{"$oid":"684339c287dc272b16890b8a"}],"ReleaseYear":"2024"}
{"_id":{"$oid":"684192b387dc272b16890b6e"},"Title":"Nosferatu","Description":"Nosferatu is a remake/homage to the 1922 film \"Nosferatu: A Symphony of Horror\". In this film, a young girl is haunted through her life by a vampire (Nosferatu), who seeks to claim her and progressively has a more and more direct influence on her life and that of those around her.","Director":{"Name":"Robert Eggers","Bio":"Robert Houston Eggers is an American filmmaker who primarily writes and directs films that contain themes such as horror, folklore, and mythology. He is known for films such as \"The Witch\" (2015), \"The Lighthouse\" (2019), \"The Northman\" (2022), and \"Nosferatu\" (2024).","BirthYear":"1983"},"Genre":{"Name":"Horror","Description":"Horror Films are films that seek to elicit fear and/or shock from the viewer using a wide variety methods. These films often invoke the supernatural or unknown in some way."},"Actors":[{"$oid":"684339c287dc272b16890b8b"},{"$oid":"684339c287dc272b16890b8c"},{"$oid":"684339c287dc272b16890b8d"},{"$oid":"684339c287dc272b16890b8e"},{"$oid":"684339c287dc272b16890b8f"},{"$oid":"684339c287dc272b16890b90"},{"$oid":"684339c287dc272b16890b91"}],"ReleaseYear":"2024"}
{"_id":{"$oid":"684197bc87dc272b16890b6f"},"Title":"Anora","Description":"Anora is the story of American stripper Anora Mikheeva who marries Ivan Zahkarov, the son of a Russian oligarch who is \"studying\" in the United States. His parents do not approve of this union and they and their representatives attempt to dissolve the union.","Director":{"Name":"Sean Baker","Bio":"Sean Baker is an American director, writer, editor, and producer of independent film, whose works often focus on marginalized people or groups.","BirthYear":1971},"Genre":{"Name":"Comedy Drama","Description":"Sean Baker is an American director, writer, editor, and producer of independent film, whose works often focus on marginalized people or groups."},"Actors":[{"$oid":"684339c287dc272b16890b92"},{"$oid":"684339c287dc272b16890b93"},{"$oid":"684339c287dc272b16890b94"},{"$oid":"684339c287dc272b16890b95"},{"$oid":"684339c287dc272b16890b96"}],"ReleaseYear":"2024"}
{"_id":{"$oid":"684197bc87dc272b16890b70"},"Title":"Dune: Part Two","Description":"Picking up where Dune: Part One left off, Dune: Part Two tells the story of Paul Atreides as learns to live like a Fremen. He then plots and takes his revenge against the family responsible for the downfall of his house: The Harkonnens.","Director":{"Name":"Denis Villeneuve","Bio":"Denis Villeneuve is a Canadian filmmaker. His early works were primarily in French, and after experiencing success forayed into English language film beginning with 2013's \"Prisoners\".","BirthYear":"1967"},"Genre":{"Name":"Space Opera","Description":"Space Opera is a sub-genre of Sci-Fi films that focus on grand galaxy-spanning stories, often involving large, inter-planetary settings, space warfare, and melodramatic stories."},"Actors":[{"$oid":"684339c287dc272b16890b97"},{"$oid":"684339c287dc272b16890b98"},{"$oid":"684339c287dc272b16890b99"},{"$oid":"684339c287dc272b16890b9a"},{"$oid":"684339c287dc272b16890b9b"},{"$oid":"684339c287dc272b16890b9c"},{"$oid":"684339c287dc272b16890b9d"},{"$oid":"684339c287dc272b16890b9e"},{"$oid":"684339c287dc272b16890b9f"},{"$oid":"684339c287dc272b16890ba0"}],"ReleaseYear":"2024"}
{"_id":{"$oid":"684197bc87dc272b16890b71"},"Title":"The Substance","Description":"Aging film star Elisabeth Sparkle is let go from her long running workout program on her 50th birthday. This leads to her experimenting with a black-market drug (The Substance) that creates a younger version of herself that can relive her glory days.","Director":{"Name":"Coralie Fargaet","Bio":"Coralie Fargeat is a French filmmaker. She rose to prominence with her debut feature film \"Revenge\" (2017), and followed that up with her even more successful film \"The Substance\" (2024).","BirthYear":1976},"Genre":{"Name":"Body Horror","Description":"Body Horror is a sub-genre of horror films that showcase grotesque or disturbing violations of the human body to illicit shock and fear from the audience."},"Actors":[{"$oid":"6843411897d3655bed34d1ff"},{"$oid":"684341ca97d3655bed34d201"},{"$oid":"6843420f97d3655bed34d202"}],"ReleaseYear":"2024"}
{"_id":{"$oid":"684197bc87dc272b16890b72"},"Title":"The Witch","Description":"When seventeenth-century puritan William and his family are banished from their settlement, they settle on a remote farm. While attempting to start their life anew, a number of mysterious tragedies begin to befall them.","Director":{"Name":"Robert Eggers","Bio":"Robert Houston Eggers is an American filmmaker who primarily writes and directs films that contain themes such as horror, folklore, and mythology. He is known for films such as \"The Witch\" (2015), \"The Lighthouse\" (2019), \"The Northman\" (2022), and \"Nosferatu\" (2024).","BirthYear":"1983"},"Genre":{"Name":"Horror","Description":"Horror Films are films that seek to elicit fear and/or shock from the viewer using a wide variety methods. These films often invoke the supernatural or unknown in some way."},"Actors":[{"$oid":"684339c287dc272b16890ba1"},{"$oid":"684339c287dc272b16890ba2"},{"$oid":"684339c287dc272b16890b91"}],"ReleaseYear":"2015"}
